slackGPT/revalidation_denied/9 PnrCancel Request.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageID xmlns:ns0="http://www.w3.org/2005/08/addressing">3b8f6141-afac-467f-b97d-8958c21b17ad
        </ns0:MessageID>
        <ns1:Action xmlns:ns1="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/PNRXCL_17_1_1A
        </ns1:Action>
        <ns2:To xmlns:ns2="http://www.w3.org/2005/08/addressing">
            https://nodeD3.production.webservices.amadeus.com/1ASIWVPKVPK
        </ns2:To>
        <wsse:Session xmlns:wsse="http://xml.amadeus.com/2010/06/Session_v3" TransactionStatusCode="InSeries">
            <wsse:SessionId>0H4IECITVO</wsse:SessionId>
            <wsse:SequenceNumber>5</wsse:SequenceNumber>
            <wsse:SecurityToken>2TPYISLQY0A5W1OBWRK8ISPJG2</wsse:SecurityToken>
        </wsse:Session>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:PNR_Cancel xmlns:ns0="http://xml.amadeus.com/PNRXCL_17_1_1A">
            <ns0:pnrActions>
                <ns0:optionCode>0</ns0:optionCode>
            </ns0:pnrActions>
            <ns0:cancelElements>
                <ns0:entryType>E</ns0:entryType>
                <ns0:element>
                    <ns0:identifier>OT</ns0:identifier>
                    <ns0:number>12</ns0:number>
                </ns0:element>
            </ns0:cancelElements>
        </ns0:PNR_Cancel>
    </soap-env:Body>
</soap-env:Envelope>
